---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.JoistSystemSpacingParam
source: html/e27b9d3a-de18-8d4e-2447-0572495d40c8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.JoistSystemSpacingParam Property

"Centerline Spacing"

## Syntax (C#)
```csharp
public static ForgeTypeId JoistSystemSpacingParam { get; }
```